#Напишите программу, которая найдёт произведение пар чисел списка. 
#Парой считаем первый и последний элемент, второй и предпоследний и т.д.
#Пример:
#- [2, 3, 4, 5, 6] => [12, 15, 16];
#- [2, 3, 5, 6] => [12, 15]


list = [i for i in range(1, 8)]
res = []
print(list)
for i in range((len(list)+1)//2):
    res.append(list[i]*list[len(list)-1-i])
print(res)